; This is the FRENCH language file for the programme “OpenFileTC” , version 1.5.2
; Translation by Claude Charries <Clo> charries@wanadoo.fr and <Paul Vansumsen> …


[Misc]           ; here info about author of this language file. Please fill all fields correctly and only about YOU :)
MiscStringsCount=4
0=Français
1=Claude_Charries_et_Paul_Vansumsen
2=1.7b
3=(C) Copyright, 2004-2007. Tous Droits réservés. Courriel : antoon_inc@mail15.com

[MainUnit]       ; here strings and messages for main window

;MainUnitStringsCount=58
0=Ouvrir le fichier %FileName% avec…
1=Programmes préférés
2=Autres programmes
3=Raccourci
4=Programmes à éliminer…
5=Autre programme
6=Choisir un programme :
7=Le fichier choisi n'est pas un exécutable !/s;Vous avez choisi“%ProgramName%”./s;Son extension n'est pas EXE./s;Voulez-vous vraiment choisir ce fichier?
8=Programme :
9=Extensions :
10=Chemin complet :
11=Programme introuvable !
12=Éditer les associations
13=Changer le chemin du programme
14=Renommer
15=Raccourci :
16=Retirer de la liste
17=Renomme…
18=Nouveau nom :
19=Voulez-vous vraiment retirer le programme “%ProgramName%”/s;de la liste des programmes disponibles ?
; changé
20=Attention : TotalCommander se trouve bien sur votre machine./s;On peut établir le programme “Ouvrir la Niche-fichiers pour TC” comme  éditeur “F4”./s;%NowStandProgram%/sAvantages :/s;- F4 ouvre chaque type de fichier dans l'éditeur approprié/s;- agencer de simples associations/s;- le programme n'est pas envahissant./s;/s;Si ces avantages vous intéressent, appuyez juste sur OUI./s;Le programme réalisera toutes les autres actions à votre place. /s;Cette question ne sera plus jamais posée.
21=Merci de ce choix !/s;/s;Si vous avez des instances de TC en marche,/s;il vous faut les relancer. Ensuite, les changements s'appliqueront.
; changed
22=Attention : “DbCD Universal” se trouve sur la machine./s;On peut établir le programme “Ouvrir la Niche-fichiers pour TC” comme visionneuse pour “DbCD Universal”./s;%NowStandProgram%/s;Avantages :/s;- chaque type de fichier ouvert par F3 le sera avec la visionneuse appropriée/s;- agencer de simples associations/s;- le programme n'est pas envahissant./s;/s;Si ces avantages vous intéressent, appuyez juste sur OUI./s;Le programme réalisera toutes les autres actions à votre place. /s;Cette question ne sera plus jamais posée.   
23=Merci de ce choix !/s;/s;Si vous avez des instances de “DbCD Universal” en marche,/s;il vous faut les relancer. Ensuite, les changements s'appliqueront.
24=Ajouter un programme qui sache/s;lire le fichier %FileName%
25=Pour l'extension en cours, toujours utiliser le programme choisi
26=Agencer %ProgramName%
27=Ouvrir sans chercher d'application
28=Ouvrir avec %ProgramName%
29=Nombre d'appels:
30=Ce programme a été lancé sans aucun paramètre. Il n'est pas recommandé d'ajouter des programmes dans ce mode. Voulez-vous toujours ajouter ce nouvel élément à la liste ?
31=Ne plus afficher la fenêtre de choix pour le type de fichier %FileType% ./s;Ouvrir le fichier avec le programme idoine précédent.
32=Confirmer
33=Agencements de “OpenFileTC”
34=Annuler
35=Tri par
36=Mode d'affichage
37=Afficher les icônes
38=Condition d'agencement
39=Vous utilisez maintenant : "%ProgramName%"
40=Liste de toutes les applications
41=Édition d'exécutable/s;/s;OpenFileTC a reçu un fichier exécutable: /s;%FileName%/s; Voulez-vous l'ajouter à la la liste des éditeurs de OpenFileTC?/s;/s;“OUI” pour ajouter cet éditeur à la liste,/s;“NON” pour éditer ce fichier.
 ; new (*)
42=L'application sera affichée dans une fenêtre.
43=Échec de création des groupes pour des éléments du programme. Il y a peut-être des erreurs dans le programme.
44=Impossible de créer le fichier d'agencements “%INIFileName%”./s;Vous avez peut-être lancé le programme d'un support en lecture seule, ou le fichier d'agencements est en lecture seule et l'on ne peut rien y écrire./s;Le programme enregistrera tous les agencements dans le dossier “%WinFolder%”
45=Une erreur s'est produite en créant le fichier d'agencements./s;Nom du fichier : "%INIFileName%"./s;Message du Système : "%SystemMessage%"./s;Classe d'erreur : "%ClassMessage%"./s;Le programme est arrêté.
46=Sans guillemets, le programme/s;n'ouvre que le 1° fichier de la liste
47=Entre guillemets, le programme/s;n'ouvre que le premier fichier de la liste
48=Sans guillemets, chaque fichier/s;sera ouvert dans une instance distincte du programme
49=Entre guillemets, chaque fichier/s;sera ouvert dans une instance distincte du programme
50=L'application sera réduite en icône en Barre des tâches.
51=Ajouter un programme qui sache/s;lire les fichiers du format choisi
52=L'application sera agrandie au maximum.

[EditExtsUnit]   
; Chaînes et messages pour la fenêtre d'accord des extensions
0=Éditer les extensions pour le programme "%ProgramName%"
EditExtsUnitStringsCount=14
1=Confirmer
2=Annuler
3=Ajouter
4=Éditer
5=Retirer
6=Nouvelle extension
7=Extension :
8=Ouvrir dans le programme approprié %ProgramName% 
9=Ouvre la fenêtre de choix des programmes (ouvrir “OpenFileTC”)
10=Action de “OpenFileTC”
11=Type
12=Ligne de commande
13=Variables autorisées :/s;%FullFileName% - nom complet du ficher/s;%FileName% - Le nom seul (ni chemin, ni extension)/s;%FileExt% - extension du fichier (sans point)/s;Les variables ne tiennent pas compte de la casse.

[SetupUnit]    ; Fenêtre des agencements
; changed
SetupUnitStringsCount=21
0=Agencements de “OpenFileTC”
1=Langue:
2=Polices et couleurs :
3=Éléments :
4=Choisir la langue dans la liste de celles disponibles./s;On peut télécharger plus de langues depuis http://antoon-inc.com/oftc/
5=Sections
6=en icônes
7=en liste
8=en petites icônes
9=Rapport
10=Charger les icônes…
11=Afficher les icônes des programmes
12=Appliquer
13=Applique toutes les modifications
14=Confirmer
15=Enregistre toutes les modification et ferme la fenêtre
16=Annuler
17=Ferme la fenêtre sans appliquer les modifications
; nouveau…
18=Chaque utilisat¦eur¦rice possède ses propres agencements
;  nouveau…
19=Utilisez cette option pour que chaque utlisat¦eur¦rice de “OpenFileTC”/s;ait des agencements séparés dans cet ordinateur
; nouveau…
20=Si ce fichier existe, alors chaque utilisat¦eur¦rice de cet ordinateur possède ses propres agencements de “OpenFileTC”. Pour utiliser les mêmes agencements pour tous, supprimez ce fichier. Ce commentaire peut être détruit.
21=Police…
22=Type, taille et couleur pour les étiquettes de fenêtre principale
23=Fond
24=Couleur du fond fenêtre principale
25=Icônes dans la cache.
26=Ne charger les icônes des EXEs qu'une fois/s;et les enregistrer dans le sous-rép. “Icons” (recommandé)
27= Interface
28=Plusieurs utilisateurs
29=À propos…
30=Choisir la vue en icônes
31=Pas de recherche d'exécutables
32=Ne pas attendre que l'exécutable/s;en termine avec le fichier ouvert
33=Afficher les info-bulles près de la souris
34=Par défaut, la bulle d'aide des exécutables/s;est affichée dans le coin de la fenêtre d'Open File TC
35=Afficher les info-bulles
36=Afficher les informations pour les applications au/s;survol de la souris
37=Fenêtre principale:
38=Dialogues:
39=Type, couleur et taille du texte des autres fenêtres
40=Tri des types d'éléments dans la fenêtre principale:
41=Choisir le type de tri pour/s;les applications ajoutées
42=Alphabétiquement
43=Par fréquence
44=L'option "Chaque utilisat¦eur¦rice possède ses propres agencements" sera activée quand OpenFileTC sera redémarré
45=Variantes pour forcer l'appel d'application
46=Touche modificatrice:
47=Si cette touche modificatrice est enfoncée,/s;alors OpenFileTC afichera toujours sa fenêtre.
48=Maintenir le curseur sur:
49=si le curseur est maintenu dans le coin choisi,/s;alors OpenFileTC affichera toujours sa fenêtre.
50=Choisir la position de souris dans la liste
51=Choisir la touche modificatrice dans la liste
52=le coin supérieur gauche
53=le coin supérieur droit
54=le coin inférieur gauche
55=le coin inférieur droit
56=Activer l'ouverture de répertoires
57=Autorise l'ouverture des répertoires sélectionnés via F4./s; Autoriser la balise %Dir% comme extension assumée./s;Plus d'informations dans le fichier d'aide ".chm"
58=État de la case à cocher “Toujours employer le programme choisi” :
59=On peut établir ici l'état de cette/s;case à cocher pour chaque lancement de OFTC. On peutavoir :/s;cet élément toujours coché actif,/s;toujours désactivé, ou en mémorisation /s;des changements
60=Mémoriser le dernier choix de l'utilisateur.
61=Toujours désactivé
62=Toujours activé
63=Ajouter l'exécutable à la liste si l'usager appuie sur F4 pour lui.
64=Si l'usager commence à éditer le fichier EXE,
/s;OpenFileTC lui demandera d'ajouter/s;cet EXE à la liste des éditeurs.
65=Page d'accueil :

[HotKeyUnit]    ; Fenêtre des raccourcis. Elle n'est disponible que depuis la  v 1.5.
;HotKeyUnitStringsCount=11
0=Raccourci
1=Établir une touche de raccourci pour lancer le programme %ProgramName%
2=Touche actuelle :
3=Nouvelle touche :
4=Confirmer
5=Enregistre les modification et ferme la fenêtre
6=Annuler
7=Ferme la fenêtre sans enregistrer
8=NON
9=Cette touche est réservée à OpenFileTC et ne peut être utilisée
10=Cette touche sert déjà dans le programme%ProgramName%/s;Voulez-vous établir cette touche pour %CurrProgramName% et l'enlever du précédent ?

[ProgramSettingsUnit]    ; new section for version 1.5, all strings are new
0=Propriétés de %ProgramName%
1=Nom :
2=Chemin :
3=Ligne de commande pour toutes les extensions :    
4=OpenFileTC ne tyrouve poas le fichier exécutable indiqué/s;Veuillez valider le chemin saisi.
5=Veuiller nommer ce programme ici
6=Chemin complet vers l'EXE
7=Choisir le fichier
8=Résoudre le problème d'ouverture des fichiers
9=Aucun problème
10=Ouvrir plusieurs fichiers avec ce programme/s;ne pose aucun problème
11=N'envoyer que le 1° fichier de la liste totale vers le programme SANS guillemets
12=Ne pas envoyer toute la liste vers la ligne de commande de l'EXE,/s;mais juste son 1° fichier SANS guillemets
13=N'envoyer à l'EXE que le 1° fichier de la liste totale ENTRE guillemets
14=Ne pas envoyer toute la liste vers la ligne de commande de l'EXE,/s;mais juste son 1° fichier ENTRE guillemets
15=Lancer une instance distincte du programme pour chaque fichier, passer le nom de fichier ENTRE guillemets
16=En lançant plusieurs copies de ce programme, /s;chaqune obtiendra un fichier de la liste comme paramètre de la ligne de commande./s;ATTENTION : dans ce cas, OpenFileTC cessera de scruter les EXES/s;ENTRE guillemets
17=Extensions…
18=Établit la liste d'extensions pour ce programme
19=Confirmer
20=Enregistre les modifications et ferme cette fenêtre
21=Annuler
22=Ferme cette fenêtre sans enregistrer
23=Lance une instance distincte du programme pour chaque fichier, passe le nom de fichier SANS guillemets
24=En lançant plusieurs copies de ce programme, /s;chaqune obtiendra un fichier de la liste comme paramètre de la ligne de commande./s;ATTENTION : dans ce cas, OpenFileTC cessera de scruter les EXES/s;SANS guillemets
25=Clic sur l'image pour choisir/s;une autre application pour l'ouvrir
26=Choix d'un fichier avec icônes
27=Enregistrer sous...
28=Raccourci…
29=Établir une combinaison de touches pour choisir/s;ce progr. dans le fenêtre de OpenFileTC.
30=Combiner une ligne de commande
31=Placer une ligne de commande ici pour toutes les extensions de cette application.
32=Changer d'icône
33=Enregistrer l'icône dans le fichier…
34=Aspect de la fenêtre à l'ouverture (fonctionnement pas garanti) :
35=Par défaut
36=Dans une fenêtre
37=Réduite en icône
38=Agrandie maxi.
39=Ouvrir directement toutes les nouvelles extensions dans cet éditeur.

[FoundClipUnit]    ; all strings are new
0=Presse-papiers trouvé
1=ID. de l'information dans le presse-papiers : %BufferID%
2=Types préétablis:
3=Attention: information inconnue dans le Presse-papiers. Tentez un reconnaissance manuelle. Utilisez la liste ci-dessus.
4=Reconnaissance automatique
5=Tenter de reconnaître le type en automatique (pas recommandé)
6=Sélectionner
7=Le type de données à bien été reconnu
8=Introuvable
9=Le type de données n'a pas été reconnu
10=Texte ( ANSI )
11=Texte ( OEM )
12=Texte ( UNICODE )
13=Image ( BMP )
14=Image ( JPG )
15=Image ( TIFF )
16=Fichier Méta (*.WM…)
17=Bloc inconnu



